Magicoe/LPC55S3x_Test_code/example_code/lpc55s3x_mdk/drivers/fsl_clock.h
    kMAIN_CLK_to_FLEXCOMM5      = MUX_A(CM_FXCOMCLKSEL5, 0), /*!< Attach MAIN_CLK to FLEXCOMM5. */
    kMAIN_CLK_FRG5_to_FLEXCOMM5 = MUX_A(CM_FXCOMCLKSEL5, 1) | MUX_B(CM_FRGCLKSEL5, 0, 0),    /*!< Attach Main clock
                                                                                                 to FlexComm5. */
    kPLL_CLK_DIV_FRG5_to_FLEXCOMM5 = MUX_A(CM_FXCOMCLKSEL5, 1) | MUX_B(CM_FRGCLKSEL5, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm5. */
    kFRO_HF_DIV_FRG5_to_FLEXCOMM5 = MUX_A(CM_FXCOMCLKSEL5, 1) | MUX_B(CM_FRGCLKSEL5, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm5. */
    kFRO12M_to_FLEXCOMM5     = MUX_A(CM_FXCOMCLKSEL5, 2), /*!< Attach FRO12M to FLEXCOMM5. */
    kFRO_HF_DIV_to_FLEXCOMM5 = MUX_A(CM_FXCOMCLKSEL5, 3), /*!< Attach FRO_HF_DIV to FLEXCOMM5. */
    kFRO1M_to_FLEXCOMM5      = MUX_A(CM_FXCOMCLKSEL5, 4), /*!< Attach FRO1M to FLEXCOMM5. */
    kMCLK_IN_to_FLEXCOMM5    = MUX_A(CM_FXCOMCLKSEL5, 5), /*!< Attach MCLK_IN to FLEXCOMM5. */
    kOSC32K_to_FLEXCOMM5     = MUX_A(CM_FXCOMCLKSEL5, 6), /*!< Attach OSC32K to FLEXCOMM5. */
    kNONE_to_FLEXCOMM5       = MUX_A(CM_FXCOMCLKSEL5, 7), /*!< Attach NONE to FLEXCOMM5. */

    kMAIN_CLK_to_FLEXCOMM6      = MUX_A(CM_FXCOMCLKSEL6, 0), /*!< Attach MAIN_CLK to FLEXCOMM6. */
    kMAIN_CLK_FRG6_to_FLEXCOMM6 = MUX_A(CM_FXCOMCLKSEL6, 1) | MUX_B(CM_FRGCLKSEL6, 0, 0),    /*!< Attach Main clock
                                                                                                 to FlexComm6. */
    kPLL_CLK_DIV_FRG6_to_FLEXCOMM6 = MUX_A(CM_FXCOMCLKSEL6, 1) | MUX_B(CM_FRGCLKSEL6, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm6. */
    kFRO_HF_DIV_FRG6_to_FLEXCOMM6 = MUX_A(CM_FXCOMCLKSEL6, 1) | MUX_B(CM_FRGCLKSEL6, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm6. */
    kFRO12M_to_FLEXCOMM6     = MUX_A(CM_FXCOMCLKSEL6, 2), /*!< Attach FRO12M to FLEXCOMM6. */
    kFRO_HF_DIV_to_FLEXCOMM6 = MUX_A(CM_FXCOMCLKSEL6, 3), /*!< Attach FRO_HF_DIV to FLEXCOMM6. */
    kFRO1M_to_FLEXCOMM6      = MUX_A(CM_FXCOMCLKSEL6, 4), /*!< Attach FRO1M to FLEXCOMM6. */
    kMCLK_IN_to_FLEXCOMM6    = MUX_A(CM_FXCOMCLKSEL6, 5), /*!< Attach MCLK_IN to FLEXCOMM6. */
    kOSC32K_to_FLEXCOMM6     = MUX_A(CM_FXCOMCLKSEL6, 6), /*!< Attach OSC32K to FLEXCOMM6. */
    kNONE_to_FLEXCOMM6       = MUX_A(CM_FXCOMCLKSEL6, 7), /*!< Attach NONE to FLEXCOMM6. */

    kMAIN_CLK_to_FLEXCOMM7      = MUX_A(CM_FXCOMCLKSEL7, 0), /*!< Attach MAIN_CLK to FLEXCOMM7. */
    kMAIN_CLK_FRG7_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 1) | MUX_B(CM_FRGCLKSEL7, 0, 0),    /*!< Attach Main clock
                                                                                                 to FlexComm7. */
    kPLL_CLK_DIV_FRG7_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 1) | MUX_B(CM_FRGCLKSEL7, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm7. */
    kFRO_HF_DIV_FRG7_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 1) | MUX_B(CM_FRGCLKSEL7, 2, 0),  /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm7. */
    kFRO12M_to_FLEXCOMM7     = MUX_A(CM_FXCOMCLKSEL7, 2), /*!< Attach FRO12M to FLEXCOMM7. */
    kFRO_HF_DIV_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 3), /*!< Attach FRO_HF_DIV to FLEXCOMM7. */
    kFRO1M_to_FLEXCOMM7      = MUX_A(CM_FXCOMCLKSEL7, 4), /*!< Attach FRO1M to FLEXCOMM7. */
    kMCLK_IN_to_FLEXCOMM7    = MUX_A(CM_FXCOMCLKSEL7, 5), /*!< Attach MCLK_IN to FLEXCOMM7. */
    kOSC32K_to_FLEXCOMM7     = MUX_A(CM_FXCOMCLKSEL7, 6), /*!< Attach OSC32K to FLEXCOMM7. */
    kNONE_to_FLEXCOMM7       = MUX_A(CM_FXCOMCLKSEL7, 7), /*!< Attach NONE to FLEXCOMM7. */

    kMAIN_CLK_to_HSLSPI    = MUX_A(CM_HSLSPICLKSEL, 0), /*!< Attach MAIN_CLK to HSLSPI. */
    kPLL_CLK_DIV_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 1), /*!< Attach PLL_CLK_DIV to HSLSPI. */
    kFRO12M_to_HSLSPI      = MUX_A(CM_HSLSPICLKSEL, 2), /*!< Attach FRO12M to HSLSPI. */
    kFRO_HF_DIV_to_HSLSPI  = MUX_A(CM_HSLSPICLKSEL, 3), /*!< Attach FRO_HF_DIV to HSLSPI. */
    kFRO1M_to_HSLSPI       = MUX_A(CM_HSLSPICLKSEL, 4), /*!< Attach FRO1M to HSLSPI. */
    kOSC32K_to_HSLSPI      = MUX_A(CM_HSLSPICLKSEL, 6), /*!< Attach OSC32K to HSLSPI. */
    kNONE_to_HSLSPI        = MUX_A(CM_HSLSPICLKSEL, 7), /*!< Attach NONE to HSLSPI. */

    kFRO_HF_to_MCLK = MUX_A(CM_MCLKCLKSEL, 0), /*!< Attach FRO_HF to MCLK. */
    kPLL0_to_MCLK   = MUX_A(CM_MCLKCLKSEL, 1), /*!< Attach PLL0 to MCLK. */
    kNONE_to_MCLK   = MUX_A(CM_MCLKCLKSEL, 7), /*!< Attach NONE to MCLK. */

    kMAIN_CLK_to_SCT = MUX_A(CM_SCTCLKSEL, 0), /*!< Attach MAIN_CLK to SCT. */
    kPLL0_to_SCT     = MUX_A(CM_SCTCLKSEL, 1), /*!< Attach PLL0 to SCT. */
    kEXT_CLK_to_SCT  = MUX_A(CM_SCTCLKSEL, 2), /*!< Attach EXT_CLK to SCT. */
    kFRO_HF_to_SCT   = MUX_A(CM_SCTCLKSEL, 3), /*!< Attach FRO_HF to SCT. */
    kPLL1_to_SCT     = MUX_A(CM_SCTCLKSEL, 4), /*!< Attach PLL1 to SCT. */
    kMCLK_IN_to_SCT  = MUX_A(CM_SCTCLKSEL, 5), /*!< Attach MCLK_IN to SCT. */
    kNONE_to_SCT     = MUX_A(CM_SCTCLKSEL, 7), /*!< Attach NONE to SCT. */

    kMAIN_CLK_to_DAC0 = MUX_A(CM_DAC0CLKSEL, 0), /*!< Attach MAIN_CLK to DAC0. */
    kPLL0_to_DAC0     = MUX_A(CM_DAC0CLKSEL, 1), /*!< Attach PLL0 to DAC0. */
    kFRO_HF_to_DAC0   = MUX_A(CM_DAC0CLKSEL, 3), /*!< Attach FRO_HF to DAC0. */
    kFRO12M_to_DAC0   = MUX_A(CM_DAC0CLKSEL, 4), /*!< Attach FRO12M to DAC0. */
    kPLL1_to_DAC0     = MUX_A(CM_DAC0CLKSEL, 5), /*!< Attach PLL1 to DAC0. */
    kFRO1M_to_DAC0    = MUX_A(CM_DAC0CLKSEL, 6), /*!< Attach FRO1M to DAC0. */
    kNONE_to_DAC0     = MUX_A(CM_DAC0CLKSEL, 7), /*!< Attach NONE to DAC0. */

    kMAIN_CLK_to_DAC1 = MUX_A(CM_DAC1CLKSEL, 0), /*!< Attach MAIN_CLK to DAC1. */
    kPLL0_to_DAC1     = MUX_A(CM_DAC1CLKSEL, 1), /*!< Attach PLL0 to DAC1. */
    kFRO_HF_to_DAC1   = MUX_A(CM_DAC1CLKSEL, 3), /*!< Attach FRO_HF to DAC1. */
    kFRO12M_to_DAC1   = MUX_A(CM_DAC1CLKSEL, 4), /*!< Attach FRO12M to DAC1. */
    kPLL1_to_DAC1     = MUX_A(CM_DAC1CLKSEL, 5), /*!< Attach PLL1 to DAC1. */
    kFRO1M_to_DAC1    = MUX_A(CM_DAC1CLKSEL, 6), /*!< Attach FRO1M to DAC1. */
    kNONE_to_DAC1     = MUX_A(CM_DAC1CLKSEL, 7), /*!< Attach NONE to DAC1. */

    kMAIN_CLK_to_DAC2 = MUX_A(CM_DAC2CLKSEL, 0), /*!< Attach MAIN_CLK to DAC2. */
    kPLL0_to_DAC2     = MUX_A(CM_DAC2CLKSEL, 1), /*!< Attach PLL0 to DAC2. */
    kFRO_HF_to_DAC2   = MUX_A(CM_DAC2CLKSEL, 3), /*!< Attach FRO_HF to DAC2. */
    kFRO12M_to_DAC2   = MUX_A(CM_DAC2CLKSEL, 4), /*!< Attach FRO12M to DAC2. */
    kPLL1_to_DAC2     = MUX_A(CM_DAC2CLKSEL, 5), /*!< Attach PLL1 to DAC2. */
    kFRO1M_to_DAC2    = MUX_A(CM_DAC2CLKSEL, 6), /*!< Attach FRO1M to DAC2. */
    kNONE_to_DAC2     = MUX_A(CM_DAC2CLKSEL, 7), /*!< Attach NONE to DAC2. */

    kMAIN_CLK_to_FLEXSPI = MUX_A(CM_FLEXSPICLKSEL, 0), /*!< Attach MAIN_CLK to FLEXSPI. */
    kPLL0_to_FLEXSPI     = MUX_A(CM_FLEXSPICLKSEL, 1), /*!< Attach PLL0 to FLEXSPI. */
    kFRO_HF_to_FLEXSPI   = MUX_A(CM_FLEXSPICLKSEL, 3), /*!< Attach FRO_HF to FLEXSPI. */
    kPLL1_to_FLEXSPI     = MUX_A(CM_FLEXSPICLKSEL, 5), /*!< Attach PLL1 to FLEXSPI. */
    kNONE_to_FLEXSPI     = MUX_A(CM_FLEXSPICLKSEL, 7), /*!< Attach NONE to FLEXSPI. */

